Autodesk.Revit.DB.Structure.TrussMemberInfo.#ctor
For Internal Use Only.
Remarks: This constructor is exposed to enable support for COM interop only. This object should never
be created by the developer.

Autodesk.Revit.DB.Structure.TrussMemberInfo.memberTypeKey
Kind of the member in the truss.

Autodesk.Revit.DB.Structure.TrussMemberInfo.lockedToTruss
Whether the member is locked to the host truss.

Autodesk.Revit.DB.Structure.TrussMemberInfo.hostTrussId
The host truss' ElementId of the member.

Autodesk.Revit.DB.Structure.TrussMemberInfo
Provides access to the information of a truss member in Autodesk Revit.
Remarks: A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.